
#Область ПрограммныйИнтерфейс

// См. РаботаСНоменклатуройКлиентПереопределяемый.СоздатьНоменклатуруИнтерактивно.
Процедура СоздатьНоменклатуруИнтерактивно(ОповещениеОЗавершении, АдресДанныхЗаполнения) Экспорт 
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("АдресДанныхЗаполнения", АдресДанныхЗаполнения) ,,,,, ОповещениеОЗавершении);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ИспользоватьПоискПоШтрихкодуВСервисе.
Процедура ИспользоватьПоискПоШтрихкодуВСервисе(ИспользоватьПоискПоШтрихкоду) Экспорт
	
	ИспользоватьПоискПоШтрихкоду = Истина;
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуДополнительногоЗначения.
Процедура ОткрытьФормуДополнительногоЗначения(РеквизитСсылка, Форма) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", РеквизитСсылка));
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.Форма.ФормаЭлемента", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуДополнительногоРеквизита.
Процедура ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Форма) Экспорт
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуНоменклатуры.
Процедура ОткрытьФормуНоменклатуры(НоменклатураСсылка, Форма) Экспорт
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", 
		Новый Структура("Ключ", НоменклатураСсылка), Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуВидаНоменклатуры.
Процедура ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Форма) Экспорт
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.Форма.ФормаЭлемента", 
		Новый Структура("Ключ", ВидНоменклатурыСсылка), Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуСпискаВидаНоменклатуры.
Процедура ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Форма) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", ВидНоменклатурыСсылка));
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.Форма.ФормаСписка", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуСпискаНоменклатуры.
Процедура ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Форма) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", НоменклатураСсылка));
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПослеЗагрузкиКатегорий.
Процедура ПослеЗагрузкиКатегорий(СозданныеОбъекты, Форма) Экспорт
	
	Если СозданныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.Список.Обновить();
	
	Форма.Элементы.Список.ТекущаяСтрока = СозданныеОбъекты[0];
		
КонецПроцедуры

#КонецОбласти
