
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТипЗначения = ПараметрыВыполненияКоманды.Источник.Объект.ТипЗначения;
	
	ИмяФормы = "Справочник._ДемоЗначенияСвойствОбъектов.ФормаСписка";
	СтруктураОбъекта = Новый Структура("Владелец", ПараметрКоманды);
	
	ОткрытьФорму(
		ИмяФормы,
		Новый Структура("Отбор", СтруктураОбъекта),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
