#Область ОписаниеПеременных

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовокФормы();
	
	УстановитьСтатусДокумента();
	
	УстановитьВидимостьПолейДоКорректировки();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// Подсистема ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения" 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Объект.Дата);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элемент);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОблагаетсяНДСУПокупателяПриИзменении(Элемент)
	
	УстановитьВидимостьПолейНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КлиентЭДОКлиент.СопоставитьНоменклатуруПоставщика(Элементы.Товары.ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РазрешитьРедактированиеРеквизитовОбъектаПослеВопроса", ЭтотОбъект);
	КлиентЭДОКлиент.ПоказатьВопросОРазрешенииРедактированияРеквизитовОбъекта(Оповещение, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Объект.ВидДокумента = Перечисления.ВидыДокументов.ТоварнаяНакладная Тогда
		ПодготовитьФормуТоварнаяНакладная();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.АктВыполненныхРабот Тогда
		ПодготовитьФормуАктВыполненныхРабот();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.АктНаПередачуПрав Тогда
		ПодготовитьФормуАктНаПередачуПрав();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.НакладнаяНаВозврат Тогда
		ПодготовитьФормуНакладнаяНаВозврат();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуТоварнаяНакладная()
	
	ПодготовитьФормуДокумента();
	
	УстановитьВидимостьПолейНДС();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуАктВыполненныхРабот()
	
	ПодготовитьФормуДокумента();
	
	Элементы.СтраницаТовары.Заголовок = НСтр("ru = 'Услуги'");
	Элементы.ТоварыГруппаСуммаАкциза.Видимость    = Ложь;
	Элементы.ТоварыНомерГТД.Видимость             = Ложь;
	Элементы.ТоварыСтранаПроисхождения.Видимость  = Ложь;
	Элементы.СтраницаСведенияОПолучении.Видимость = Ложь;
	Элементы.ОблагаетсяНДСУПокупателя.Видимость   = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуАктНаПередачуПрав()
	
	ПодготовитьФормуАктВыполненныхРабот();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНакладнаяНаВозврат()
	
	ПодготовитьФормуДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуДокумента()
	
	СформироватьЗаголовокФормы();
	
	УстановитьСтатусДокумента();
	
	УстановитьВидимостьПолейДоКорректировки();
	
	УстановитьВозможностьРедактированияРеквизитов(ЭтотОбъект, Ложь);
	
	Если НЕ ПравоДоступа("Изменение", Объект.Ссылка.Метаданные()) Тогда
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Видимость = Ложь;
	КонецЕсли;
	
	СчетФактура = Документы.СчетФактураПолученный.СчетФактураДокумента(Объект.Ссылка);
	УстановитьПредставлениеСчетаФактуры(ЭтотОбъект);
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.Реализация Тогда
		Элементы.ГруппаОснование.Видимость = Ложь;
		Элементы.ГруппаНомерИсправления.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсходногоДокумента.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправленияИсходногоДокумента.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправляемогоКорректировочногоДокумента.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.Исправление Тогда
		УстановитьПредставлениеДокументаОснования();
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.Корректировка Тогда
		Элементы.ГруппаНомерИсправления.Видимость = Ложь;
		Элементы.СтраницаСведенияОПолучении.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправляемогоКорректировочногоДокумента.Видимость = Ложь;
		УстановитьПредставлениеДокументаОснования();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокФормы()
	
	ЭтотОбъект.Заголовок = КлиентЭДОКлиентСервер.ПредставлениеВходящегоДокумента(Объект, Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокумента()
	
	СтатусДокумента = КлиентЭДО.СтатусДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСчетаФактуры(Форма)
	
	Если ЗначениеЗаполнено(Форма.СчетФактура) Тогда
		Форма.СчетФактураПредставление = Новый ФорматированнаяСтрока(
			Строка(Форма.СчетФактура),,,,ПолучитьНавигационнуюСсылку(Форма.СчетФактура));
	Иначе
		Форма.Элементы.СчетФактураПредставление.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеДокументаОснования()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ДокументОснованиеПредставление = Новый ФорматированнаяСтрока(
			Строка(Объект.ДокументОснование), ,
			ЦветаСтиля.ГиперссылкаЦвет, ,
			ПолучитьНавигационнуюСсылку(Объект.ДокументОснование));
		
	ИначеЕсли Объект.ВидОперации <> Перечисления.ВидыОпераций.Реализация Тогда
		
		ПредставлениеОснования = "";
		
		Если ЗначениеЗаполнено(Объект.НомерИсправляемогоКорректировочногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсправляемогоКорректировочногоДокумента) Тогда
			
			ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 от %2'"),
				Объект.НомерИсправляемогоКорректировочногоДокумента,
				Формат(Объект.ДатаИсправляемогоКорректировочногоДокумента, "ДЛФ=D"));
			
		ИначеЕсли ЗначениеЗаполнено(Объект.НомерИсходногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсходногоДокумента) Тогда
			
			Если ЗначениеЗаполнено(Объект.НомерИсправленияИсходногоДокумента)
				И ЗначениеЗаполнено(Объект.ДатаИсправленияИсходногоДокумента) Тогда
				
				ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 (испр. %2) от %3'"),
					Объект.НомерИсходногоДокумента,
					Объект.НомерИсправленияИсходногоДокумента,
					Формат(Объект.ДатаИсправленияИсходногоДокумента, "ДЛФ=D"));
				
			Иначе
				
				ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 от %2'"),
					Объект.НомерИсходногоДокумента,
					Формат(Объект.ДатаИсходногоДокумента, "ДЛФ=D"));
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументОснованиеПредставление = Новый ФорматированнаяСтрока(
			ПредставлениеОснования + " " + НСтр("ru='<Отсутствует>'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейДоКорректировки();
	
	ВидимостьДоКорректировки = Объект.ВидОперации = Перечисления.ВидыОпераций.Корректировка
		ИЛИ (ЗначениеЗаполнено(Объект.НомерИсправляемогоКорректировочногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсправляемогоКорректировочногоДокумента));
	
	Элементы.ТоварыГруппаЗаголовкиСтрок.Видимость       = ВидимостьДоКорректировки;
	Элементы.ТоварыКоличествоДоКорректировки.Видимость  = ВидимостьДоКорректировки;
	Элементы.ТоварыЦенаДоКорректировки.Видимость        = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаДоКорректировки.Видимость       = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаНДСДоКорректировки.Видимость    = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаСНДСДоКорректировки.Видимость   = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаАкцизаДоКорректировки.Видимость = ВидимостьДоКорректировки;
	
	Если ВидимостьДоКорректировки Тогда
		Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
			ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьДоКорректировки    = НСтр("ru = 'До корректировки:'");
	СтрокаТаблицы.НадписьПослеКорректировки = НСтр("ru = 'После корректировки:'");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейНДС()
	
	ВидимостьНДС = НЕ Объект.ОблагаетсяНДСУПокупателя;
	Элементы.ТоварыСтавкаНДС.Видимость = ВидимостьНДС;
	Элементы.ТоварыГруппаСуммаНДС.Видимость  = ВидимостьНДС;
	Элементы.ТоварыГруппаСуммаСНДС.Видимость = ВидимостьНДС;
	Элементы.ИтогиВсегоНДС.Видимость = ВидимостьНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитовОбъектаПослеВопроса(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьВозможностьРедактированияРеквизитов(ЭтотОбъект);
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВозможностьРедактированияРеквизитов(Форма, Значение = Истина)
	
	Заблокировать = НЕ Значение;
	
	Элементы = Форма.Элементы;
	
	Элементы.Контрагент.ТолькоПросмотр = Заблокировать;
	Элементы.Организация.ТолькоПросмотр = Заблокировать;
	
	Элементы.Грузоотправитель.ТолькоПросмотр = Заблокировать;
	Элементы.Грузополучатель.ТолькоПросмотр = Заблокировать;
	Элементы.Перевозчик.ТолькоПросмотр = Заблокировать;
	Элементы.НомерТранспортнойНакладной.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаТранспортнойНакладной.ТолькоПросмотр = Заблокировать;
	Элементы.СведенияОТранспортировкеИГрузе.ТолькоПросмотр = Заблокировать;
	
	Элементы.ДоговорКонтрагента.ТолькоПросмотр = Заблокировать;
	Элементы.БанковскийСчетКонтрагента.ТолькоПросмотр = Заблокировать;
	Элементы.ИдентификаторГосКонтракта.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсправленияИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсправленияИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсправляемогоКорректировочногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсправляемогоКорректировочногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ОблагаетсяНДСУПокупателя.ТолькоПросмотр = Заблокировать;
	
	Элементы.ТоварыНоменклатураПоставщика.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЕдиницаИзмерения.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыКоличествоДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыКоличество.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЦенаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЦена.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСумма.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСтавкаНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаНДСДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаСНДСДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаСНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаАкцизаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаАкциза.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыНомерГТД.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСтранаПроисхождения.ТолькоПросмотр = Заблокировать;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт	
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

#КонецОбласти
