#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формирует уникальное наименование объекта.
//
Процедура СформироватьНаименование() Экспорт
	
	Наименование = КлиентЭДОКлиентСервер.НаименованиеБанковскогоСчетаПоУмолчанию(
		НомерСчета,
		Строка(Банк),
		Строка(Владелец));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Владелец") Тогда
			
			Владелец = ДанныеЗаполнения.Владелец;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли