

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьНаСервере()
	
	РезультатыПроверки.Очистить();
	
	// Проверка метода ЗаполнитьДанныеПо1СЭДОДляМастера1СОтчетности
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ЗаполнитьДанныеПо1СЭДОДляМастера1СОтчетности'");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.Предопределенный";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НоваяСтрока.Метод = НСтр("ru = 'Организацию не удалось определить. Метод нельзя проверить.'");
	
	Иначе
		Выбора = Запрос.Выполнить().Выбрать();
		Выбора.Следующий();
		
		ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
		Попытка
			ДополнительныеПараметры = Новый Структура("ЕстьПодключениеЭДО, МассивОператоровЭДО, СсылкаОписаниеСервиса");
			ОбменСКонтрагентами.ЗаполнитьДанныеПо1СЭДОДляМастера1СОтчетности(Выбора.Организация, ДополнительныеПараметры);
			
			Если Не ЗначениеЗаполнено(ДополнительныеПараметры.ЕстьПодключениеЭДО)
				ИЛИ Не ЗначениеЗаполнено(ДополнительныеПараметры.МассивОператоровЭДО)
				ИЛИ Не ЗначениеЗаполнено(ДополнительныеПараметры.СсылкаОписаниеСервиса) Тогда
				
				ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецПопытки;
		
		НоваяСтрока.Результат = ТекстСообщения;
		
	КонецЕсли;
	
	// Проверка метода ОрганизацияПодключена
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ОрганизацияПодключена'");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.Предопределенный";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НоваяСтрока.Метод = НСтр("ru = 'Организацию не удалось определить. Метод нельзя проверить.'");
	
	Иначе
		Выбора = Запрос.Выполнить().Выбрать();
		Выбора.Следующий();
		
		ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
		Попытка
			ОрганизацияПодключена = ОбменСКонтрагентами.ОрганизацияПодключена(Выбора.Организация);
		Исключение
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецПопытки;
		НоваяСтрока.Результат = ТекстСообщения;
	КонецЕсли;
	
	// Проверка метода ПолучитьСоответствиеДокументамИБКомплектыЭлектронныхДокументов
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ПолучитьСоответствиеДокументамИБКомплектыЭлектронныхДокументов'");
	
	СвойстваЭД = Новый Соответствие;
	МассивЭД = Новый Массив;
	ОбменСКонтрагентами.ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС(СвойстваЭД, МассивЭД);
	
	Если Не ЗначениеЗаполнено(СвойстваЭД) Тогда
		ТекстСообщения = НСтр("ru = 'Электронный документ не удалось определить. Метод нельзя проверить.'");
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
		Попытка
			Для каждого ЗначенияСвойств Из СвойстваЭД Цикл
				
				УникальныйИдентификаторФормы = Новый УникальныйИдентификатор;
				СтруктураСвойствЭД = ЗначенияСвойств.Значение;
				СоответствиеДокументамИБКомплектыЭД = ОбменСКонтрагентами.ПолучитьСоответствиеДокументамИБКомплектыЭлектронныхДокументов(
					СтруктураСвойствЭД.ВладелецЭД, УникальныйИдентификаторФормы);
				
				Если Не ЗначениеЗаполнено(СоответствиеДокументамИБКомплектыЭД) Тогда
					ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
				КонецЕсли;
				
				Прервать;
			
			КонецЦикла;
		Исключение
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецПопытки;
		
	КонецЕсли;
	НоваяСтрока.Результат = ТекстСообщения;
	
	// Проверка метода ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС.
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС'");
	
	ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
	Попытка
		СвойстваЭД = Новый Соответствие;
		МассивЭД = Новый Массив;
		ОбменСКонтрагентами.ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС(СвойстваЭД, МассивЭД);
		
		Если Не ЗначениеЗаполнено(СвойстваЭД) Тогда
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
	КонецПопытки;
	
	НоваяСтрока.Результат = ТекстСообщения;
	
	// Проверка метода ОпределитьВладельцаЭлектронногоДокумента
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ОпределитьВладельцаЭлектронногоДокумента'");
	
	СвойстваЭД = Новый Соответствие;
	МассивЭД = Новый Массив;
	ОбменСКонтрагентами.ОпределитьСвойстваЭДДляЖурналаДокументовПредставляемыхПоТребованиюФНС(СвойстваЭД, МассивЭД);
	
	Если Не ЗначениеЗаполнено(СвойстваЭД) Тогда
		ТекстСообщения = НСтр("ru = 'Электронный документ не удалось определить. Метод нельзя проверить.'");
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
		Попытка
			Для каждого ЗначенияСвойств Из СвойстваЭД Цикл
				ВладелецЭД = Неопределено;
				ОбменСКонтрагентами.ОпределитьВладельцаЭлектронногоДокумента(ЗначенияСвойств.Ключ, ВладелецЭД);
				
				Если ВладелецЭД = Неопределено Тогда
					ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
				КонецЕсли;
				
				Прервать;
			КонецЦикла;
		Исключение
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецПопытки;
		
	КонецЕсли;
	НоваяСтрока.Результат = ТекстСообщения;
	
	// Проверка метода ОпределитьСвойстваВладельцевЭлектронныхДокументов
	НоваяСтрока = РезультатыПроверки.Добавить();
	НоваяСтрока.Метод = НСтр("ru = 'ОпределитьСвойстваВладельцевЭлектронныхДокументов'");
	
	ТекстСообщения = НСтр("ru = 'Метод работает корректно.'");
	Попытка
		СвойстваВладельцевЭД = Новый Соответствие;
		МассивВладельцевЭД = Новый Массив;
		ОбменСКонтрагентами.ОпределитьСвойстваВладельцевЭлектронныхДокументов(СвойстваВладельцевЭД, МассивВладельцевЭД);
		
		Если Не ЗначениеЗаполнено(СвойстваВладельцевЭД) Тогда
			ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'В работе метода возникли ошибки.'");
	КонецПопытки;
	
	НоваяСтрока.Результат = ТекстСообщения;
	
	
КонецПроцедуры

#КонецОбласти
