
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// ЭлектронноеВзаимодействие.ТорговыеПредложения
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ПараметрыКоманды", ПараметрКоманды);
	
	ОткрытьФорму("Обработка.ТорговыеПредложения.Форма.ПоискПоТоварам",
		СтруктураРеквизитов,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка)
		
	// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения
		
КонецПроцедуры

#КонецОбласти
