#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Корректировка");
	ЗначенияЗаполнения = Новый Структура("Основание, ВидОперации", ПараметрКоманды, ВидОперации);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
	Если ТипПараметраКоманды = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ИначеЕсли ТипПараметраКоманды = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти