#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	УстановитьПредставлениеНомера();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидДокумента = Перечисления.ВидыДокументов.СчетФактураНаАванс Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Номенклатура");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивНепроверяемыхРеквизитов) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
	КлиентЭДО.ОбработкаПроверкиЗаполнения(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПредставлениеНомера()
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		ПредставлениеНомера = СтрШаблон(НСтр("ru = '%1 (испр. %2)'"),
			НомерЭД, НомерИсправления);
	Иначе
		ПредставлениеНомера = НомерЭД;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли