#Область СлужебныйПрограммныйИнтерфейс

// См. процедуру ОбменДаннымиПереопределяемый.ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию().
//
Процедура ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс) Экспорт
	
	Префикс = НСтр("ru = 'КЭ'");
	
КонецПроцедуры

// См. процедуру ОбменДаннымиПереопределяемый.ПолучитьПланыОбмена().
//
Процедура ПолучитьПланыОбмена(ПланыОбменаПодсистемы) Экспорт
	
	ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеПредприятиемКлиентЭДО);
	ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлей103КлиентЭДО);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменУправлениеПредприятиемКлиентЭДО".

// См. процедуру ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента().
//
Процедура ОбменУправлениеПредприятиемКлиентЭДОЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменУправлениеПредприятиемКлиентЭДО", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// См. процедуру ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью().
//
Процедура ОбменУправлениеПредприятиемКлиентЭДОЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеПредприятиемКлиентЭДО", Источник, Отказ);
	
КонецПроцедуры

// См. процедуру ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением().
//
Процедура ОбменУправлениеПредприятиемКлиентЭДОЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеПредприятиемКлиентЭДО", Источник, Отказ);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменУправлениеТорговлей103КлиентЭДО".

// См. процедуру ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента().
//
Процедура ОбменУправлениеТорговлей103КлиентЭДОЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменУправлениеТорговлей103КлиентЭДО", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// См. процедуру ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью().
//
Процедура ОбменУправлениеТорговлей103КлиентЭДОЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеТорговлей103КлиентЭДО", Источник, Отказ);
	
КонецПроцедуры

// См. процедуру в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением().
//
Процедура ОбменУправлениеТорговлей103КлиентЭДОЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеТорговлей103КлиентЭДО", Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти
