#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	МакетДокумента = Обработки.НачалоРаботыКЭДО.ПолучитьМакет("УсловияЛицензионногоСоглашения");
	ТекстЛицензионногоСоглашения = МакетДокумента.ПолучитьТекст();
	ПодтверждениеВыбора = 0;  // Пользователю требуется явно выбрать один из вариантов.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыПродолжить(Команда)
	
	СоглашениеПринято = Ложь;
	Если ПодтверждениеВыбора = 1 Тогда
		УстановитьЛицензионноеСоглашениеПринято();
		СоглашениеПринято = Истина;
	КонецЕсли;
	
	Закрыть(СоглашениеПринято);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьЛицензионноеСоглашениеПринято()
	
	КлиентЭДО.УстановитьЛицензионноеСоглашениеПринято();
	
КонецПроцедуры

#КонецОбласти