#Область ПрограммныйИнтерфейс

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ЗаполнитьПрофильПользователь(ОписанияПрофилей);
	ЗаполнитьПрофильОператор(ОписанияПрофилей);
	ЗаполнитьПрофильМенеджер(ОписанияПрофилей);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПрофильПользователь(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Пользователь";
	ОписаниеПрофиля.Идентификатор = "09e56dbf-90a0-11de-862c-001d600d9ad2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Просмотр данных информационной системы.'");
	
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПоставщиков");
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ДополнительныеСведения", "ВначалеВсеРазрешены");
	
	// Использование онлайн-поддержки
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКСервисуИнтернетПоддержки");
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ЗаполнитьПрофильОператор(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Оператор";
	ОписаниеПрофиля.Идентификатор = "75fa0eca-98aa-11df-b54f-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Просмотр нормативно-справочной информации. 
			|Формирование, подписание и обмен электронными документами.
			|Сопоставление номенклатуры с номенклатурой поставщиков.'");
	
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ДополнительныеСведения", "ВначалеВсеРазрешены");
	
	// Использование онлайн-поддержки
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКСервисуИнтернетПоддержки");
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ЗаполнитьПрофильМенеджер(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер";
	ОписаниеПрофиля.Идентификатор = "c7e34f11-9890-11df-b54f-e0cb4ed5f655";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Добавление и изменение нормативно-справочной информации.
			|Формирование, подписание и обмен электронными документами.
			|Добавление и изменение настроек обмена с контрагентами.'");
	
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыПоставщиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатовВХранилище");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКЭДО");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	
	// Использование онлайн-поддержки
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКСервисуИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеСервисовСопровождения");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ДополнительныеСведения", "ВначалеВсеРазрешены");
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти