#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает значение ставки НДС.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - ставка НДС.
//
// Возвращаемое значение:
//  Число - значение ставки.
//
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС) Экспорт
	
	Результат = 0;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Результат = 0.1;
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Результат = 0.18;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
