
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = ЭтотОбъект;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "СписокИсходящий, СписокВходящий";
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыКомандЭДО = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыКомандЭДО.Форма = ЭтотОбъект;
	
	ПараметрыКомандЭДО.МестоРазмещенияКоманд = Элементы.КомандыЭДОИсходящие;
	ПараметрыКомандЭДО.Направление = Перечисления.НаправленияЭД.Исходящий;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыКомандЭДО);
	
	ПараметрыКомандЭДО.МестоРазмещенияКоманд = Элементы.КомандыЭДОВходящие;
	ПараметрыКомандЭДО.Направление = Перечисления.НаправленияЭД.Входящий;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыКомандЭДО);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	Если Элементы.СтраницыОпераций.ТекущаяСтраница = Элементы.СтраницыОпераций.ПодчиненныеЭлементы.Исходящие Тогда
		ТекущийСписок = Элементы.СписокИсходящий;
	Иначе
		ТекущийСписок = Элементы.СписокВходящий;
	КонецЕсли; 
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, ТекущийСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	МестоРазмещенияКоманд = Новый Массив;
	МестоРазмещенияКоманд.Добавить(Элементы.КомандыЭДОВходящие);
	МестоРазмещенияКоманд.Добавить(Элементы.КомандыЭДОИсходящие);
	
	ПараметрыОжидания = ОбменСКонтрагентамиКлиент.ПараметрыОжиданияЭДО();
	ПараметрыОжидания.МестоРазмещенияКоманд = МестоРазмещенияКоманд;
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

