#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Константы._ДемоПоказыватьПодсистему1CБизнесСеть.Установить(Ложь);
	Константы._ДемоПоказыватьПодсистемуИнтеграцияСЯндексКассой.Установить(Ложь);
	Константы._ДемоПоказыватьПодсистемуОбменСБанками.Установить(Ложь);
	Константы._ДемоПоказыватьПодсистемуОбменСКонтрагентами.Установить(Ложь);
	Константы._ДемоПоказыватьПодсистемуОбменССайтами.Установить(Ложь);
	Константы._ДемоПоказыватьПодсистемуРаботаСНоменклатурой.Установить(Ложь);
	Константы.ИспользоватьИнтеграциюСЯндексКассой.Установить(Ложь);
	Константы.ИспользоватьОбменБизнесСеть.Установить(Ложь);
	Константы.ИспользоватьОбменСБанками.Установить(Ложь);
	Константы.ИспользоватьОбменССайтом.Установить(Ложь);
	Константы.ИспользоватьОбменЭД.Установить(Ложь);
	Константы.ИспользоватьСервисРаботаСНоменклатурой.Установить(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьРаботу(Команда)
	
	НачатьРаботуНаСервере();
	ОбновитьИнтерфейс();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачатьРаботуНаСервере()
	
	Константы._ДемоПоказыватьПодсистему1CБизнесСеть.Установить(БизнесСеть);
	Константы._ДемоПоказыватьПодсистемуИнтеграцияСЯндексКассой.Установить(ЯндексКасса);
	Константы._ДемоПоказыватьПодсистемуОбменСБанками.Установить(ОбменСБанками);
	Константы._ДемоПоказыватьПодсистемуОбменСКонтрагентами.Установить(ОбменСКонтрагентами);
	Константы._ДемоПоказыватьПодсистемуОбменССайтами.Установить(ОбменССайтами);
	Константы._ДемоПоказыватьПодсистемуРаботаСНоменклатурой.Установить(РаботаСНоменклатурой);
	Константы.ИспользоватьИнтеграциюСЯндексКассой.Установить(ЯндексКасса);
	Константы.ИспользоватьОбменБизнесСеть.Установить(БизнесСеть);
	Константы.ИспользоватьОбменСБанками.Установить(ОбменСБанками);
	Константы.ИспользоватьОбменССайтом.Установить(ОбменССайтами);
	Константы.ИспользоватьОбменЭД.Установить(ОбменСКонтрагентами);
	Константы.ИспользоватьСервисРаботаСНоменклатурой.Установить(РаботаСНоменклатурой);
	Константы._ДемоДатаПервогоВходаВСистему.Установить(ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти