
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов_Шапка

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость() 
	
	ЭтоОплата = (Объект.ХозяйственнаяОперация = "Оплата");
	ЭтоВозврат = (Объект.ХозяйственнаяОперация = "Возврат");
	
	Элементы.СпособОплаты.Видимость = ЭтоОплата;
	Элементы.ТипОперацииВозврата.Видимость = ЭтоВозврат;
	
КонецПроцедуры

#КонецОбласти