////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с номенклатурой".
// ОбщийМодуль.РаботаСНоменклатуройКлиентПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура открывает форму элемента номенклатуры в случает интерактивного заполнения.
// При открытии формы, ей должен передаваться параметр АдресДанныхЗаполнения, в котором указывается
// адрес временного хранилища из переменной АдресДанныхЗаполнения.
//
// Параметры:
//  ОповещениеОЗавершении - ОбработкаОповещения - обработчик закрытия формы. В обработчик должен передаваться
//                                                параметр НоменклатураСсылка с ссылкой на элемент.
//  АдресДанныхЗаполнения - Строка - адрес временного хранилища с данными номенклатуры.
//
Процедура СоздатьНоменклатуруИнтерактивно(ОповещениеОЗавершении, АдресДанныхЗаполнения) Экспорт 
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.СоздатьНоменклатуруИнтерактивно(ОповещениеОЗавершении, АдресДанныхЗаполнения);
	// КлиентЭДО конец
	
КонецПроцедуры

// Процедура управляет возможностью поиска номенклатуры в сервисе 1С:Номенклатура по штрихкоду.
//
// Параметры:
//  ИспользоватьПоискПоШтрихкоду - Булево - флаг использования функционала сервиса.
//
Процедура ИспользоватьПоискПоШтрихкодуВСервисе(ИспользоватьПоискПоШтрихкоду) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ИспользоватьПоискПоШтрихкодуВСервисе(ИспользоватьПоискПоШтрихкоду);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы значения дополнительного реквизита.
//
// Параметры:
//  РеквизитСсылка	     - Ссылка - ссылка на дополнительный реквизит.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуДополнительногоЗначения(РеквизитСсылка, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуДополнительногоЗначения(РеквизитСсылка, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы дополнительного реквизита.
//
// Параметры:
//  ПараметрыФормы	 - Структура - параметры формы.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы номенклатуры.
//
// Параметры:
//  НоменклатураСсылка	 - Ссылка - ссылка на номенклатуру.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуНоменклатуры(НоменклатураСсылка, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуНоменклатуры(НоменклатураСсылка, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы вида номенклатуры.
//
// Параметры:
//  ВидНоменклатурыСсылка - Ссылка - ссылка на вид номенклатуры.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы списка вида номенклатуры.
//
// Параметры:
//  ВидНоменклатурыСсылка - Ссылка - ссылка на вид номенклатуры.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Открытие формы списка номенклатуры.
//
// Параметры:
//  НоменклатураСсылка	 - Ссылка - ссылка на номенклатуру.
//  Владелец			 - УправляемаяФорма - форма владелец.
//
Процедура ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Владелец) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Владелец);
	// КлиентЭДО конец
	
КонецПроцедуры

// Обработка загрузки категорий в форме списка вида номенклатуры.
//
// Параметры:
//  СозданныеОбъекты - Массив - ссылки на созданные элементы.
//  Форма			 - УправляемаяФорма - форма списка вида номенклатуры.
//
Процедура ПослеЗагрузкиКатегорий(СозданныеОбъекты, Форма) Экспорт
	
	// КлиентЭДО начало
	РаботаСНоменклатуройКлиентКЭДО.ПослеЗагрузкиКатегорий(СозданныеОбъекты, Форма);
	// КлиентЭДО конец
		
КонецПроцедуры

#КонецОбласти
