#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения._ДемоЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения._ДемоЦеныНоменклатуры.Добавить();
		Движение.Период         = Дата;
		Движение.Номенклатура   = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.ВидЦены        = ВидЦены;
		Движение.Цена           = ТекСтрокаТовары.Цена;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли